Revit 2024 API
PDFExportOptions.ZoomType Property
 Zoom type of either fit to page or on a specific percentage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public ZoomType ZoomType { get; set; }
Visual Basic
Public Property ZoomType As ZoomType
	Get
	Set
Visual C++
public:
property ZoomType ZoomType {
	ZoomType get ();
	void set (ZoomType value);
}
Remarks
 This property would be ignored if the PaperFormat is Default.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace